jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KExx_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KExx_DFP</name>
  <description>Freescale Kinetis KExx Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2014-07-29">
      Added Boards FRDM-KE04Z, FRDM-KE06Z.
      Added examples for FRDM-KE06Z.
    </release>
    <release version="1.1.0" date="2014-06-12">
      Updated SVD files
    </release>
    <release version="1.0.0">
      First Release version of KExx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KExx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="KExx Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <book    name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>

      <!-- ******************************  KE02  ****************************** -->
      <subFamily DsubFamily="KE02">
      
      <!-- ******************************  MKE02Z16xxx2  ****************************** -->
      <device Dname="MKE02Z16xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\MKE02Z2.h"  define="MKE02Z16xxx2"/>
        <debug      svd="SVD\MKE02Z2.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0600"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFE00"  size="0x0200"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P16KB.FLM" start="0x00000000" size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
        <book       name="Documents\MKE02Z64M20SF0RM.pdf"                  title="MKE02Z16xxx2 Device Reference Manual"/>
        <book       name="Documents\MKE02P64M20SF0.pdf"                    title="MKE02Z16xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 20 MHz
  Operating Characteristics
  - Voltage range: 2.7 to 5.5 V
  - Flash write voltage range: 2.7 to 5.5 V
  - Temperature range (ambient): -40 to 105B0C
  - Up to 20 MHz ARMB. Cortex-M0+ core
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  - One low-power stop mode, one wait mode
  - Low-voltage detection
  - Watchdog with independent clock source
  - Programmable CRC
  - Serial wire debug interface (SWD)
  - Bit Manipulation Engine (BME)
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  - General-purpose input/output (GPIO)
  - Two 8-bit keyboard interrupt modules (KBI)
  Analog modules
  - One 16-channel 12-bit SAR ADC
  - Two analog comparator containing a 6-bit DAC
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      
      <!-- ******************************  MKE02Z32xxx2  ****************************** -->
      <device Dname="MKE02Z32xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\MKE02Z2.h"  define="MKE02Z32xxx2"/>
        <debug      svd="SVD\MKE02Z2.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0C00"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFC00"  size="0x0400"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P32KB.FLM" start="0x00000000" size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE02Z64M20SF0RM.pdf"                  title="MKE02Z32xxx2 Device Reference Manual"/>
        <book       name="Documents\MKE02P64M20SF0.pdf"                    title="MKE02Z32xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 20 MHz
  Operating Characteristics
  - Voltage range: 2.7 to 5.5 V
  - Flash write voltage range: 2.7 to 5.5 V
  - Temperature range (ambient): -40 to 105B0C
  - Up to 20 MHz ARMB. Cortex-M0+ core
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  - One low-power stop mode, one wait mode
  - Low-voltage detection
  - Watchdog with independent clock source
  - Programmable CRC
  - Serial wire debug interface (SWD)
  - Bit Manipulation Engine (BME)
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  - General-purpose input/output (GPIO)
  - Two 8-bit keyboard interrupt modules (KBI)
  Analog modules
  - One 16-channel 12-bit SAR ADC
  - Two analog comparator containing a 6-bit DAC
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      
      <!-- ******************************  MKE02Z64xxx2  ****************************** -->
      <device Dname="MKE02Z64xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\MKE02Z2.h"  define="MKE02Z64xxx2"/>
        <debug      svd="SVD\MKE02Z2.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0C00"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFC00"  size="0x0400"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE02Z64M20SF0RM.pdf"                  title="MKE02Z64xxx2 Device Reference Manual"/>
        <book       name="Documents\MKE02P64M20SF0.pdf"                    title="MKE02Z64xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 20 MHz
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  - One low-power stop mode, one wait mode
  - Low-voltage detection
  - Watchdog with independent clock source
  - Programmable CRC
  - Serial wire debug interface (SWD)
  - Bit Manipulation Engine (BME)
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  - General-purpose input/output (GPIO)
  - Two 8-bit keyboard interrupt modules (KBI)
  Analog modules
  - One 16-channel 12-bit SAR ADC
  - Two analog comparator containing a 6-bit DAC
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      <!-- ******************************  MKE02Z64xxx4  ****************************** -->
      <device Dname="MKE02Z64xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device\Include\MKE02Z4.h"  define="MKE02Z64xxx4"/>
        <debug      svd="SVD\MKE02Z4.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0C00"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFC00"  size="0x0400"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <description>
ARM Cortex-M0+ running at up to 40 MHz
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  - Internal 1 kHz low-power oscillator (LPO)
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  – Power management module (PMC) : Run, Wait, Stop modes
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)  
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  – Up to 57 general-purpose input/output (GPIO)
  – Two 8-bit keyboard interrupt modules (KBI)
  – External interrupt (IRQ)  
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      <!-- ******************************  MKE02Z32xxx4  ****************************** -->
      <device Dname="MKE02Z32xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device\Include\MKE02Z4.h"  define="MKE02Z32xxx4"/>
        <debug      svd="SVD\MKE02Z4.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0C00"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFC00"  size="0x0400"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P32KB.FLM" start="0x00000000" size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
        <description>
ARM Cortex-M0+ running at up to 40 MHz
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  - Internal 1 kHz low-power oscillator (LPO)
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  – Power management module (PMC) : Run, Wait, Stop modes
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)  
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  – Up to 57 general-purpose input/output (GPIO)
  – Two 8-bit keyboard interrupt modules (KBI)
  – External interrupt (IRQ)  
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      <!-- ******************************  MKE02Z16xxx4  ****************************** -->
      <device Dname="MKE02Z16xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device\Include\MKE02Z4.h"  define="MKE02Z16xxx4"/>
        <debug      svd="SVD\MKE02Z4.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0600"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFE00"  size="0x0200"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE02Zxxx_P16KB.FLM" start="0x00000000" size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
        <algorithm  name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
        <description>
ARM Cortex-M0+ running at up to 40 MHz
  Memories and memory interfaces
  - Up to 64 KB flash
  - Up to 256 B EEPROM
  - Up to 4 KB RAM
  - Internal 1 kHz low-power oscillator (LPO)
  Clocks
  - 31.25 kHz to 39.0625 kHz oscillator
  - 4 MHz to 20 MHz oscillator
  System peripherals
  – Power management module (PMC) : Run, Wait, Stop modes
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)  
  Security and integrity modules
  - 64-bit unique identification (ID) number per chip
  Human-machine interface
  – Up to 57 general-purpose input/output (GPIO)
  – Two 8-bit keyboard interrupt modules (KBI)
  – External interrupt (IRQ)  
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  - One 6-channel FlexTimer/PWM (FTM)
  - Two 2-channel FlexTimer/PWM (FTM)
  - One 2-channel periodic interrupt timer (PIT)
  - One Real-time clock (RTC)
  Communication interfaces
  - Two 8-bit SPI modules (SPI)
  - Three SCI/UART modules (SCI)
  - One I2C module (I2C)
  Package options
  - 64-pin QFP/LQFP
  - 44-pin LQFP
  - 32-pin LQFP
        </description>
      </device>
      </subFamily>
      <!-- ******************************  KE04  ****************************** -->
      <subFamily DsubFamily="KE04">
      <!-- ******************************  MKE04Z8xxx4  ****************************** -->
      <device Dname="MKE04Z8xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\MKE04Z4.h"  define="MKE04Z8xxx4"/>
        <debug      svd="SVD\MKE04Z4.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0300"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFFF00"  size="0x0100"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE04Zxxx_P8KB.FLM" start="0x00000000" size="0x2000"    RAMstart="0x1FFFFF00"  RAMsize="0x400"  default="1"/>
        <book       name="Documents\MKE04P80M48SF0RM.pdf"                  title="MKE04Z8xxx4 Device Reference Manual"/>
        <book       name="Documents\MKE04P80M48SF0.pdf"                    title="MKE04Z8xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
Memories and memory interfaces
 - Up to 8 KB flash
 - Up to 1 KB RAM
Clocks
 - 31.25 kHz to 39.0625 kHz oscillator
 - 4 MHz to 20 MHz oscillator
System peripherals
 - PMC with three power modes: 
   Run, Wait, Stop - Low-voltage detection
 - Watchdog with independent clock source
 - Programmable CRC
 - Serial wire debug interface (SWD)
 - Aliased SRAM bitband region (BITBAND)
 - Bit Manipulation Engine (BME)
Security and integrity modules
 - 80-bit unique identification (ID) number per chip
Human-machine interface
 - Up to 22 general-purpose input/output (GPIO) 
 - Two 8-bit keyboard interrupt modules (KBI)
Analog modules
 - One 12-channel 12-bit SAR ADC
 - Two analog comparator containing a 6-bit DAC
Timers
 - One 6-channel FlexTimer/PWM (FTM)
 - Two 2-channel FlexTimer/PWM (FTM)
 - One 2-channel periodic interrupt timer (PIT)
 - One pulse width timer (PWT)
 - One Real-time clock (RTC)
Communication interfaces
 - One 8-bit SPI modules (SPI)
 - One SCI/UART modules (SCI)
 - One I2C module (I2C)
Package options
 - 24-pin QFN
 - 20-pin SOIC
 - 16-pin TSSOP
      </description>
      </device>
      <device Dname="MKE04Z64xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\MKE04Z1284.h"  define="MKE04Z64xxx4"/>
        <debug      svd="SVD\MKE04Z1284.svd"/>
        <memory     id="IROM1"                       start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                       start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                       start="0x1FFFF800"  size="0x0800"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE04Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE04P80M48SF0RM.pdf"                  title="MKE04Z64xxx4 Device Reference Manual"/>
        <book       name="Documents\MKE04P80M48SF0.pdf"                    title="MKE04Z64xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
Memories and memory interfaces
 - Up to 128 KB flash
 - Up to 16 KB RAM
Clocks
 - 31.25 kHz to 39.0625 kHz oscillator
 - 4 MHz to 20 MHz oscillator
System peripherals
 - PMC with three power modes: 
   Run, Wait, Stop - Low-voltage detection
 - Watchdog with independent clock source
 - Programmable CRC
 - Serial wire debug interface (SWD)
 - Aliased SRAM bitband region (BITBAND)
 - Bit Manipulation Engine (BME)
Security and integrity modules
 - 80-bit unique identification (ID) number per chip
Human-machine interface
 - Up to 22 general-purpose input/output (GPIO) 
 - Two 8-bit keyboard interrupt modules (KBI)
 � External interrupt (IRQ)
Analog modules
 - One 16-channel 12-bit SAR ADC
 - Two analog comparator containing a 6-bit DAC
Timers
 - One 6-channel FlexTimer/PWM (FTM)
 - Two 2-channel FlexTimer/PWM (FTM)
 - One 2-channel periodic interrupt timer (PIT)
 - One pulse width timer (PWT)
 - One Real-time clock (RTC)
Communication interfaces
 - Two 8-bit SPI modules (SPI)
 - Three SCI/UART modules (SCI)
 - Two I2C module (I2C)
Package options
 - 80-pin LQFP
 - 64-pin QFP/LQFP
 - 44-pin LQFP
      </description>
      </device>
      <device Dname="MKE04Z128xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\MKE04Z1284.h"  define="MKE04Z128xxx4"/>
        <debug      svd="SVD\MKE04Z1284.svd"/>
        <memory     id="IROM1"                       start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                       start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                       start="0x1FFFF000"  size="0x1000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE04Zxxx_P128KB.FLM" start="0x00000000" size="0x20000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE04P80M48SF0RM.pdf"                  title="MKE04Z128xxx4 Device Reference Manual"/>
        <book       name="Documents\MKE04P80M48SF0.pdf"                    title="MKE04Z128xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
Memories and memory interfaces
 - Up to 128 KB flash
 - Up to 16 KB RAM
Clocks
 - 31.25 kHz to 39.0625 kHz oscillator
 - 4 MHz to 20 MHz oscillator
System peripherals
 - PMC with three power modes: 
   Run, Wait, Stop - Low-voltage detection
 - Watchdog with independent clock source
 - Programmable CRC
 - Serial wire debug interface (SWD)
 - Aliased SRAM bitband region (BITBAND)
 - Bit Manipulation Engine (BME)
Security and integrity modules
 - 80-bit unique identification (ID) number per chip
Human-machine interface
 - Up to 22 general-purpose input/output (GPIO) 
 - Two 8-bit keyboard interrupt modules (KBI)
 - External interrupt (IRQ)
Analog modules
 - One 16-channel 12-bit SAR ADC
 - Two analog comparator containing a 6-bit DAC
Timers
 - One 6-channel FlexTimer/PWM (FTM)
 - Two 2-channel FlexTimer/PWM (FTM)
 - One 2-channel periodic interrupt timer (PIT)
 - One pulse width timer (PWT)
 - One Real-time clock (RTC)
Communication interfaces
 - Two 8-bit SPI modules (SPI)
 - Three SCI/UART modules (SCI)
 - Two I2C module (I2C)
Package options
 - 80-pin LQFP
 - 64-pin QFP/LQFP
 - 44-pin LQFP
      </description>
      </device>
      </subFamily>
      <subFamily DsubFamily="KE06">
      <!-- ******************************  MKE06Z64xxx4  ****************************** -->
      <device Dname="MKE06Z64xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\MKE06Z4.h"  define="MKE06Z64xxx4"/>
        <debug      svd="SVD\MKE06Z4.svd"/>
        <memory     id="IROM1"                       start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                       start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                       start="0x1FFFF800"  size="0x0800"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE06Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE06P80M48SF0RM.pdf"                  title="MKE06Z64xxx4 Device Reference Manual"/>
        <book       name="Documents\MKE06P80M48SF0.pdf"                    title="MKE06Z64xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
Memories and memory interfaces
 - Up to 128 KB flash
 - Up to 16 KB SRAM
Clocks
 - 31.25 kHz to 39.0625 kHz oscillator
 - 4 MHz to 24 MHz oscillator
Package options
 - 64-pin QFP
 - 44-pin LQFP
 - 64-pin LQFP
 - 80-pin LQFP
      </description>
      </device>
