jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KExx_DFP.1.2.0.pdsc
      <!-- ******************************  MKE06Z128xxx4  ****************************** -->
      <device Dname="MKE06Z128xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\MKE06Z4.h"  define="MKE06Z128xxx4"/>
        <debug      svd="SVD\MKE06Z4.svd"/>
        <memory     id="IROM1"                       start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                       start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                       start="0x1FFFF000"  size="0x1000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MKE06Zxxx_P128KB.FLM" start="0x00000000" size="0x20000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        <book       name="Documents\MKE06P80M48SF0RM.pdf"                  title="MKE06Z128xxx4 Device Reference Manual"/>
        <book       name="Documents\MKE06P80M48SF0.pdf"                    title="MKE06Z128xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
Memories and memory interfaces
 - Up to 128 KB flash
 - Up to 16 KB SRAM
Clocks
 - 31.25 kHz to 39.0625 kHz oscillator
 - 4 MHz to 24 MHz oscillator
Package options
 - 64-pin QFP
 - 44-pin LQFP
 - 64-pin LQFP
 - 80-pin LQFP
      </description>
      </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="KE02Z2">
      <description>Freescale Kinetis KE02 20MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE02Z16xxx2"/>
      <accept Dname="MKE02Z32xxx2"/>
      <accept Dname="MKE02Z64xxx2"/>
    </condition>
    <condition id="KE02Z4">
      <description>Freescale Kinetis KE02 40MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE02Z16xxx4"/>
      <accept Dname="MKE02Z32xxx4"/>
      <accept Dname="MKE02Z64xxx4"/>
    </condition>
    <condition id="KE04Z4">
      <description>Freescale Kinetis KE04 48MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE04Z8xxx4"/>
      </condition>
    <condition id="KE04Z1284">
      <description>Freescale Kinetis KE04 64kB/128kB 48MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE04Z64xxx4"/>
      <accept Dname="MKE04Z128xxx4"/>
    </condition>
    <condition id="KE06Z4">
      <description>Freescale Kinetis KE06 48MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE06Z64xxx4"/>
      <accept Dname="MKE06Z128xxx4"/>
    </condition>
    <condition id="Kinetis KExx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Freescale device from KLxx Series and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78" Dname="MKE*"/>
    </condition>

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Kinetis KExx CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Freescale KExx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_KExx    /* Device Startup for KExx */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_MKE02Z2.s"     attr="config"     condition="KE02Z2"/>
        <file category="source" name="Device\Source\ARM\startup_MKE02Z4.s"     attr="config"     condition="KE02Z4"/>
        <file category="source" name="Device\Source\ARM\startup_MKE04Z4.s"     attr="config"     condition="KE04Z4"/>
        <file category="source" name="Device\Source\ARM\startup_MKE04Z1284.s"  attr="config"     condition="KE04Z1284"/>
        <file category="source" name="Device\Source\ARM\startup_MKE06Z4.s"     attr="config"     condition="KE06Z4"/>
        <!-- system file -->
        <file category="source" name="Device\Source\system_MKE02Z2.c"      attr="config"     condition="KE02Z2"/>
        <file category="source" name="Device\Source\system_MKE02Z4.c"      attr="config"     condition="KE02Z4"/>
        <file category="source" name="Device\Source\system_MKE04Z4.c"      attr="config"     condition="KE04Z4"/>
        <file category="source" name="Device\Source\system_MKE04Z1284.c"   attr="config"     condition="KE04Z1284"/>
        <file category="source" name="Device\Source\system_MKE06Z4.c"      attr="config"     condition="KE06Z4"/>
        </files>
    </component>
  </components>

  <boards>
    <board name="FRDM-KE04Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KE04Z is an ultra-low-cost development platform for Kinetis KE04 MCUs.</description>
      <book category="manual"    name="Documents\FRDM-KE04ZUG.pdf" title="Freedom KE04 User’s Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKE04Z8xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KExx Series" DsubFamily="KE04"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="ContOther"      n="1"              name="Capacitive touch slider"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>

    <board name="FRDM-KE06Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KE06Z is a simple, yet sophisticated development platform for Kinetis KE06 MCUs.</description>
      <book category="manual"    name="Documents\FRDMKE06UG.pdf" title="Freedom KE06 User’s Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KExx Series" DsubFamily="KE06"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="CAN"            n="1"              name="CAN communication"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>
  </boards>

  <examples>
    <!-- FRDM-KE04Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KE04Z\Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE04Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE04Z8xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
	
    <!-- FRDM-KE06Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KE06Z\Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE06Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
	
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KE06Z\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KE06Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
